<?php

require_once "marray.php";

$newsData = array (
  0 => 
  array (
    'id' => '17455156507597619948',
    'title' => '《拆弹专家》首映 刘德华:票房就拜托老铁了',
    'summary' => '昨日，刘德华监制并主演的城市反恐警匪题材电影《拆弹专家》首映，养伤中的“劳模”刘德华仍然牵挂新片，专门拍了视频隔空助阵。刘德华借用网络流行语说，“票房就拜托老铁了”，他还请大家放心，自己的恢复状况良好，“还是那个很帅的刘德华”。昨天《拆弹专家》在北京首映，导演邱礼涛与主演姜武、宋佳、姜皓文、吴卓羲、蔡瀚亿等出席，刘德华又拍了一段视频。',
    'url' => 'http://m.baidu.com/feed/data/landingpage?dsp=wise&n_type=-1&p_from=-1&nid=17455156507597619948',
    'site' => '新浪娱乐',
    'thumb' => '',
    'pubtime' => '2017-04-27 02:01:00',
    'sorttime' => 1493229660,
  ),
  1 => 
  array (
    //'id' => '8537029113761063042',
    'id' => '17455156507597619948',
    'title' => '华仔伤后首“露脸”“我还是那个很帅的刘德华”',
    'summary' => '电影《拆弹专家》昨天在京举行发布会,姜武、宋佳、姜皓文、吴卓羲以及导演邱礼涛等亮相。谈到与刘德华的合作时,他也称赞华仔不论在哪个方面都做的非常好,“这是华仔演得最好的一部警察电影”。戏里当“超人女朋友”的宋佳称赞华仔是热爱工作热爱片场的人,“这是我与刘德华第二次合作,没有女演员能拒绝与华仔在电影中谈恋爱”。',
    'url' => 'http://m.baidu.com/feed/data/landingpage?dsp=wise&n_type=-1&p_from=-1&nid=8537029113761063042',
    'site' => '网易新闻',
    'thumb' => 'http://t11.baidu.com/it/u=164954797,3907942415&fm=82&s=8029DD127E9AA480722009F70300A0E1&w=121&h=81&img.JPEG',
    'pubtime' => '2017-04-27 01:00:41',
    'sorttime' => 1493226041,
  ),
  2 => 
  array (
    'id' => '5407224219679834019',
    'title' => '两影帝拼演技 姜武压迫刘德华享受“爆破”感觉',
    'summary' => '4月26日，《拆弹专家》首映礼在北京博纳影城举行，现场被称为“史上最强悍匪”的姜武与刘德华两大“影帝”隔空上演飙戏大战，而“老戏骨”姜武超强的演技更是令现场粉丝折服，堪称“爆破全场”。姜武在剧中饰演一位用爆炸追求极致的艺术的“悍匪”火爆，据姜武透露，自己在电影中与刘德华的对手戏不是最多，反而与“炸弹”在一起相处的时间是最多的，正是因为与炸弹的“零接触”，才使得姜武在电影中将“火爆”的人物性格，诠释的鲜明而突出。',
    'url' => 'http://m.baidu.com/feed/data/landingpage?dsp=wise&n_type=-1&p_from=-1&nid=5407224219679834019',
    'site' => '腾讯娱乐',
    'thumb' => 'http://t12.baidu.com/it/u=2091399659,2427963987&fm=82&s=82204CA714C11AF9D001693803004053&w=121&h=81&img.JPEG',
    'pubtime' => '2017-04-27 10:15:09',
    'sorttime' => 1493259309,
  ),
);

//print_r($newsData);
$data = MArray::arrayUniqueWithField($newsData, 'id');
print_r($data);
